'''
https://www.acmicpc.net/problem/2751
수 정렬하기 2
시간 제한	메모리 제한	제출	정답	맞은 사람	정답 비율
2 초	256 MB	129459	34313	23353	30.034%
문제
N개의 수가 주어졌을 때, 이를 오름차순으로 정렬하는 프로그램을 작성하시오.

입력
첫째 줄에 수의 개수 N(1 ≤ N ≤ 1,000,000)이 주어진다. 둘째 줄부터 N개의 줄에는 숫자가 주어진다. 이 수는 절댓값이 1,000,000보다 작거나 같은 정수이다. 수는 중복되지 않는다.

출력
첫째 줄부터 N개의 줄에 오름차순으로 정렬한 결과를 한 줄에 하나씩 출력한다.

예제 입력 1 
5
5
4
3
2
1
예제 출력 1 
1
2
3
4
5
출처
데이터를 추가한 사람: ho94949, pichulia
비슷한 문제
2750번. 수 정렬하기
10989번. 수 정렬하기 3
알고리즘 분류
정렬
'''

import sys
input = sys.stdin.readline

lst = []
for i in range(int(input())):
    n = int(input())
    lst.append(n)

lst.sort()

for i in lst:
    print(i)